uhnp/src/InformationRegisters/РазмерыКонтрагентовДляЕИС/РазмерыКонтрагентовДляЕИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РазмерыКонтрагентовДляЕИС</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Размер</name>
    <type>
      <types>EnumRef.РазмерыКонтрагентовДляЕИС</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/РазмерыКонтрагентовДляЕИС/РазмерыКонтрагентовДляЕИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РазмерыКонтрагентовДляЕИС</name>
  <enumValues>
    <name>Микро</name>
  </enumValues>
  <enumValues>
    <name>Малый</name>
  </enumValues>
  <enumValues>
    <name>Средний</name>
  </enumValues>
  <enumValues>
    <name>Крупный</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Documents/РегистрацияРазмераКонтрагентаДляЕИС/РегистрацияРазмераКонтрагентаДляЕИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РегистрацияРазмераКонтрагентаДляЕИС</name>
  <registerRecords>InformationRegister.РазмерыКонтрагентовМСПДляЕИС</registerRecords>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РазмерыКонтрагентов</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>EnumRef.РазмерыКонтрагентовДляЕИС</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/InformationRegisters/РазмерыКонтрагентовДляЕИС/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
#Область ПрограммныйИнтерфейс


// Возвращает размер контрагента на текущую, либо указанную дату.
//
// Параметры:
//  Контрагент - - 
//  Дата - Дата|Неопределено - дата на которую нужно получить сведения.
//		Если передано Неопределено, то текущая дата будет получена
//		по текущей дате сеанса.
// 
// Возвращаемое значение:
//   - ПеречислениеСсылка.РазмерыКонтрагентовДляЕИС.
// 			Если для контрагента нет зарегистрированного размера, будет
// 			возвращен размер Крупный.
//
Функция ПолучитьРазмер(Контрагент, Дата=Неопределено) Экспорт
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РазмерыКонтрагентовДляЕИССрезПоследних.Размер КАК Размер
			|ИЗ
			|	РегистрСведений.РазмерыКонтрагентовДляЕИС.СрезПоследних(&Дата, Контрагент = &Контрагент) КАК РазмерыКонтрагентовДляЕИССрезПоследних";
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Возврат ВыборкаДетальныеЗаписи.Размер;
		КонецЦикла;
	КонецЕсли;
	Возврат Перечисления.РазмерыКонтрагентовДляЕИС.Крупный;
КонецФункции

// Возвращает документ РегистрацияРазмераКонтрагентаДляЕИС, который зарегистрировал
// размер РазмерВход для контрагента КонтрагентВход. Когда документ не найден - будет
// возвращена пустая ссылка.
Функция НайтиДокументРегистрацииРазмера(КонтрагентВход, РазмерВход = Неопределено) Экспорт
	РезультатФункции = Документы.РегистрацияРазмераКонтрагентаДляЕИС.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(РегистрацияРазмераКонтрагентаДляЕИСРазмерыКонтрагентов.Ссылка.ДатаРегистрации) КАК ДатаРегистрации
		|ПОМЕСТИТЬ ВТ_МаксДата
		|ИЗ
		|	Документ.РегистрацияРазмераКонтрагентаДляЕИС.РазмерыКонтрагентов КАК РегистрацияРазмераКонтрагентаДляЕИСРазмерыКонтрагентов
		|ГДЕ
		|	РегистрацияРазмераКонтрагентаДляЕИСРазмерыКонтрагентов.Контрагент = &Контрагент
		|	И ВЫБОР
		|			КОГДА &ЕстьРазмер
		|				ТОГДА РегистрацияРазмераКонтрагентаДляЕИСРазмерыКонтрагентов.Размер = &Размер
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	РегистрацияРазмераКонтрагентаДляЕИСРазмерыКонтрагентов.Ссылка КАК Ссылка
		|ИЗ
		|	ВТ_МаксДата КАК ВТ_МаксДата
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РегистрацияРазмераКонтрагентаДляЕИС.РазмерыКонтрагентов КАК РегистрацияРазмераКонтрагентаДляЕИСРазмерыКонтрагентов
		|		ПО ВТ_МаксДата.ДатаРегистрации = РегистрацияРазмераКонтрагентаДляЕИСРазмерыКонтрагентов.Ссылка.ДатаРегистрации";
	Запрос.УстановитьПараметр("Контрагент", КонтрагентВход);
	Если ЗначениеЗаполнено(РазмерВход) Тогда
		Запрос.УстановитьПараметр("Размер", РазмерВход);
		Запрос.УстановитьПараметр("ЕстьРазмер", Истина);
	Иначе
		Запрос.УстановитьПараметр("Размер", РазмерВход);
		Запрос.УстановитьПараметр("ЕстьРазмер", Ложь);
	КонецЕсли;
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РезультатФункции = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	Возврат РезультатФункции;
КонецФункции		 // НайтиДокументРегистрацииРазмера()

#КонецОбласти


#КонецЕсли
